#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-uxgiXjBwbeYh1ccq

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.database.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.secondary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/secondary-policy]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.secondary.aws_iam_role_policy_attachment.this: Refreshing state... [id=secondary-role-20231105112810173300000001]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.secondary.data.aws_subnet.self: Refreshing...
module.database.data.aws_subnet.self: Refreshing...
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.secondary.aws_security_group.this: Refreshing state... [id=sg-06499fd654cd0b866]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.database.data.aws_subnet.self: Refresh complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.secondary.data.aws_subnet.self: Refresh complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1760375090]
module.secondary.aws_security_group_rule.allow_inbound_ipv6_https: Refreshing state... [id=sgrule-3593912321]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2531630954]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3873468700]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3245959933]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-978673540]
module.secondary.aws_security_group_rule.allow_inbound_ipv6_ssh: Refreshing state... [id=sgrule-769416183]
module.secondary.aws_instance.this: Refreshing state... [id=i-0d506cd22642eedac]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3592804283]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-350438361]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.database.aws_security_group_rule.allow_inbound_connections_from_instances["sg-06499fd654cd0b866"]: Refreshing state... [id=sgrule-4280258016]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-004b70de70a6e650a]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.opentracker_tags: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sns_topic.outages will be created
  + resource "aws_sns_topic" "outages" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "outages"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.outages will be created
  + resource "aws_sns_topic_subscription" "outages" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "alexanderjackson@protonmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>